data_assignment/foam_cases/6deg_unrefined/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
 

application     rhoSimpleFoam;
 
startFrom       startTime;
 
startTime       0;
 
stopAt          endTime;
 
endTime         40;
 
deltaT          0.00005;

adjustTimeStep  yes;

maxCo 1;
 
writeControl    runTime;
 
writeInterval   2;
 
purgeWrite      0;
 
writeFormat     ascii;
 
writePrecision  8;
 
writeCompression off;
 
timeFormat      general;
 
timePrecision   6;
 

runTimeModifiable true;
 
functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        timeStart       100;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            nut
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            T 
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

        );
    }
    
    forces
    {
        type            forceCoeffs;
        libs            (forces);
//        outputControl       timeStep;
        outputInterval      writeInterval;

        patches
        (
           Airfoil Flap
        );
        p               p;
        U               U;
        rho             rhoInf;
        rhoInf      1.2049;

        CofR        (0 0 0);
        // 6 deg
        liftDir     (-0.1045284633 0.99452189 0);
        dragDir     (0.99452189 0.1045284633 0);
        
        // 13.1 deg
        //liftDir     (-0.2266513074 0.9739759673 0);
        //dragDir     (0.9739759673 0.2266513074 0);
        
        // 0 deg
//         liftDir     (0 1 0);
//         dragDir     (1 0 0);
        
        pitchAxis   (0 0 1);
        magUInf     63.476;
        lRef        1.;
        Aref        1.;
    }
}
 
// ************************************************************************* //
